print('Поле чудес')
print('П****')

ask1 = input('Введите букву - ')
while ask1 != 'Т':
    print('Неудача! Попробуй снова')
    ask1 = input('Введите букву - ')
print('Удачно! Продолжай')
print('ПТ***')

ask1 = input('Введите букву - ')
while ask1 != 'И':
    print('Неудача! Попробуй снова')
    ask1 = input('Введите букву - ')
print('Удачно! Продолжай')
print('ПТИ**')

ask1 = input('Введите букву - ')
while ask1 != 'Ц':
    print('Неудача! Попробуй снова')
    ask1 = input('Введите букву - ')
print('Удачно! Продолжай')
print('ПТИЦ*')

ask1 = input('Введите букву - ')
while ask1 != 'А':
    print('Неудача! Попробуй снова')
    ask1 = input('Введите букву - ')
print('Удачно! Продолжай')
print('ПТИЦА')
print('Вы выиграли!')